Revit 2026 API

# TransactWithCentralOptions Properties

---

The TransactWithCentralOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

TransactWithCentralOptions Class

Autodesk.Revit.DB Namespace